azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
  #define LED_RGB_RED                         12     //D6
  #define LED_RGB_GREEN                       13     //D7
  #define LED_RGB_BLUE                        15     //D8

  #define PIN_PIR                             5      //D1
  #define PIN_VIBRO                           0      //D3
  #define PIN_LIGHT_SENSOR_DIGITAL            14     //D5
  #define PIN_LIGHT_SENSOR_ANALOG             A0     //A0
#endif

//**********************************
//** Configuración *****************
//**********************************
#define VERBOSE

#define MQTT_POSTINTERVAL_DHT22_SEC         40
#define MQTT_POSTINTERVAL_LIGHT_SEC         45

#define DELAY_MIN_MS_ENTRE_MOVS             5000
#define DELAY_MIN_MS_ENTRE_VIBRO_SENSOR     4000
#define DELAY_MIN_MS_ENTRE_LIGHT_SENSOR     3000

#define DELTA_MS_TO_TURN_OFF_MOVS           3000
#define DELTA_MS_TO_TURN_OFF_VIBRO          3000
#define PERSISTENT_STATE_MS_UNTIL_STANDBY   2000

//Settings for recording samples
#define RESULTS_SAMPLE_RATE                 8            // # seconds between samples
#define SENSOR_HISTORY_RECORDS              10           // # records to keep
#define NUM_MAX_ERRORS_DHT                  20           // Abort on max

//**********************************
//** Librerías *********************
//**********************************
#ifdef USE_ESP32
  #include "WiFiEsp.h"
#else
  #include <ESP8266WiFi.h>
#endif
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <elapsedMillis.h>
#ifdef DHTPIN
  #include <list>
  #include <Adafruit_Sensor.h>  // - Adafruit Unified Sensor Library: https://github.com/adafruit/Adafruit_Sensor
  #include <DHT.h>              // - DHT Sensor Library: https://github.com/adafruit/DHT-sensor-library
  #include <DHT_U.h>
#endif

//**********************************
//** Variables *********************
//**********************************
#define DELAY_MS_BETWEEN_RETRIES            250
char MAC_char[18];                          //MAC address in ascii
//Wifi client
#ifdef USE_ESP32
  WiFiEspClient wifiClient;
#else
  WiFiClient wifiClient;
#endif
//MQTT client
void callback_mqtt_message_received(char* topic, byte* payload, unsigned int length);
PubSubClient client(MQTT_SERVER, MQTT_PORT, callback_mqtt_message_received, wifiClient);

#ifdef DHTPIN                               // DHT22/DHT11 sensor settings.
DHT_Unified dht(DHTPIN, DHTTYPE);
// Variables for recording samples of the DHT22 sensor.
std::list<double> tempSamples;   //Collected results per interval
std::list<double> humidSamples;  //Collected results per interval
std::list<double> tempHistory;   //History over time.
std::list<double> humidHistory;  //History over time.
#endif

// Contadores de tiempo
elapsedMillis sinceStart;
int last_sensor_error;
int last_sensor_ok;
int last_dht_sensed;         //The last time a sample was taken from the DHT22 sensor.
int error_counter_dht;

int last_dht22_post;            // Init value to wait some time before the 1st publish.
int last_light_post;            // Init value to wait some time before the 1st publish.
int last_state_change;

// Estados (para el output LED RGB)
#define STATE_ERROR            1
#define STATE_WARN             2
#define STATE_BIN_PUBLISH      3
#define STATE_OK_MEASURE       4
#define STATE_OK_PUBLISH       5
#define STATE_INIT             6
#define STATE_STANDBY          7
#define STATE_CRITICAL         8
int current_state;

// Binary sensors variables for control them within interrupts
volatile int last_pir_trigered = 0;
volatile int last_vibro_trigered = 0;
volatile int last_light_trigered = 0;

volatile bool pir_state = LOW;
volatile bool vibro_state = LOW;
volatile bool light_state = LOW;
bool last_light_post_state = LOW;

volatile bool flag_publish_pir = LOW;
volatile bool flag_publish_vibro = LOW;
volatile bool flag_publish_light = LOW;

//**********************************
//** SETUP
//**********************************

bool read_json(byte *payload, unsigned int payload_length)
{
  StaticJsonBuffer<500> jsonBuffer;
  char *json = (char*)payload;
  JsonObject& root = jsonBuffer.parseObject(json);

  // Test if parsing succeeds.
  if (!root.success())
  {
    Serial.println("parseObject() failed");
    return false;
  }
  else if (root.containsKey("color"))
  {
    // Fetch values.
    uint16_t R, G, B;
    R = root["color"][0];
    G = root["color"][1];
    B = root["color"][2];
    Serial.print("RGB RECEIVED: (");
    Serial.print(R);
    Serial.print(", ");
    Serial.print(G);
    Serial.print(", ");
    Serial.print(B);
    Serial.println(")");
    set_color_rgb(4 * R, 4 * G, 4 * B);
    return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), "COLOR SET");
  }
//# TODO Implementar ++ mqtt_control_topic: "control/module_"
//  else if ()
//  {
//  }
  return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), payload, payload_length);
}

void callback_mqtt_message_received(char* topic, byte* payload, unsigned int payload_length)
{
  byte *p = (byte*)malloc(payload_length);
  bool result;
  memcpy(p, payload, payload_length);

  Serial.println("MQTT MSG ARRIVED:");
  Serial.print(" --> topic=");
  Serial.println(topic);
  Serial.print(" --> payload=");
  Serial.println((char*)p);

  result = read_json(p, payload_length);
  free(p);
}

void setup()
{
  uint8_t MAC_array[6];

  Serial.begin(9600);
  setup_timers();
  setup_leds();
//  test_colors_rgb();
  set_state(STATE_INIT);
  connectWiFi();

  //Get the mac and convert it to a string.
  WiFi.macAddress(MAC_array);
  for (int i = 0; i < sizeof(MAC_array); ++i)
  {
    sprintf(MAC_char, "%s%02x", MAC_char, MAC_array[i]);
  }

#ifdef DHTPIN
  setup_temp_sensor();
#endif
  setup_boolean_sensors();

#ifdef VERBOSE
  Serial.print("MAC ADRESS: ");
  Serial.println(MAC_char);
#endif
  set_state(STATE_CRITICAL);
}

void test_colors_rgb()
{
#ifdef VERBOSE
#ifdef LED_RGB_RED
  Serial.println("RGB TEST");

  Serial.println("STATE_INIT: (1023, 1023, 1023)");
  set_color_rgb(1023, 1023, 1023);
  delay(1000);

  Serial.println("STATE_ERROR: (1023, 0, 0)");
  set_color_rgb(1023, 0, 0);
  delay(1000);

  Serial.println("STATE_WARN: (1023, 512, 0)");
  set_color_rgb(1023, 512, 0);
  delay(1000);

