azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
  Serial.println("STATE_CRITICAL: (0, 1023, 1023)");
  set_color_rgb(0, 1023, 1023);
  delay(1000);

  Serial.println("STATE_OK_MEASURE: (0, 0, 1023)");
  set_color_rgb(0, 0, 1023);
  delay(1000);

  Serial.println("STATE_OK_PUBLISH: (0, 1023, 0)");
  set_color_rgb(0, 1023, 0);
  delay(1000);

  Serial.println("STATE_other: (512, 512, 0)");
  set_color_rgb(512, 512, 0);
  delay(1000);

  Serial.println("STATE_other_2: (0, 1023, 512)");
  set_color_rgb(0, 1023, 512);
  delay(1000);

  Serial.println("STATE_other_3: (1023, 0, 1023)");
  set_color_rgb(1023, 0, 1023);
  delay(1000);

  Serial.println("STATE_other_4: (1023, 0, 512)");
  set_color_rgb(1023, 0, 512);
  delay(1000);

  Serial.println("STATE_STANDBY: (0, 0, 0)");
  set_color_rgb(0, 0, 0);
  delay(1000);
#endif
#endif
}


//**********************************
//** LOOP
//**********************************
const char *i_text_state_pubsubclient(int state)
{
  //Returns the current state of the client. If a connection attempt fails, this can be used to get more information about the failure.
  switch (state)
  {
    case -4:
      return "MQTT_CONNECTION_TIMEOUT - the server didn't respond within the keepalive time";
    case -3:
      return "MQTT_CONNECTION_LOST - the network connection was broken";
    case -2:
      return "MQTT_CONNECT_FAILED - the network connection failed";
    case -1:
      return "MQTT_DISCONNECTED - the client is disconnected cleanly";
    case 0:
      return "MQTT_CONNECTED - the cient is connected";
    case 1:
      return "MQTT_CONNECT_BAD_PROTOCOL - the server doesn't support the requested version of MQTT";
    case 2:
      return "MQTT_CONNECT_BAD_CLIENT_ID - the server rejected the client identifier";
    case 3:
      return "MQTT_CONNECT_UNAVAILABLE - the server was unable to accept the connection";
    case 4:
      return "MQTT_CONNECT_BAD_CREDENTIALS - the username/password were rejected";
    case 5:
      return "MQTT_CONNECT_UNAUTHORIZED - the client was not authorized to connect";
  }
  return "MQTT_STATE ????";
}

void loop()
{
  bool sensor_ok = false;
  bool sensed_data = false;
  bool bin_publish = false;
  int mqtt_retries = 0;

  //Reconnect if disconnected.
  if(WiFi.status() != WL_CONNECTED)
  {
    set_state(STATE_CRITICAL);
    connectWiFi();
  }

  //Check the MQTT connection and process it
  if (!client.connected())
  {
    while (!client.connected())
    {
      if (!client.connect(MQTT_USERID, MQTT_USER, MQTT_PASSWORD,
                          (MQTT_WILLTOPIC + String(MAC_char)).c_str(), MQTT_WILLQOS,
                          MQTT_WILLRETAIN, MQTT_WILLMESSAGE))
      {
        set_state(STATE_ERROR);
        Serial.print(i_text_state_pubsubclient(client.state()));
        Serial.print("MQTT retry # ");
        Serial.println(mqtt_retries);
        delay(DELAY_MS_BETWEEN_RETRIES);
      }
      mqtt_retries += 1;
    }
    client.subscribe((mqtt_control_topic + String(MAC_char)).c_str()); // , 1);
  }
  client.loop();

  turn_off_motion_sensors_after_delay();
  bin_publish = publish_motion_and_light_sensors_if_flag_or_delta();
#ifdef DHTPIN
  sample_dht22_sensor_data(&sensed_data, &sensor_ok);
#endif
  if (publish_dht22_sensor_data())
  {
    set_state(STATE_OK_PUBLISH);
  }
  else if (sensed_data && sensor_ok)
  {
    set_state(STATE_OK_MEASURE);
  }
  else if (sensed_data)
  {
    set_state(STATE_WARN);
  }
  else if (bin_publish)
  {
    set_state(STATE_BIN_PUBLISH);
  }
  else
  {
    auto_standby();
  }
}

//**********************************
//** METHODS
//**********************************

void auto_standby()
{
  if ((sinceStart - last_state_change > PERSISTENT_STATE_MS_UNTIL_STANDBY)
      && current_state != STATE_STANDBY && !i_state_critical())
  {
    set_state(STATE_STANDBY);
  }
}

void turn_off_motion_sensors_after_delay()
{
#ifdef PIN_PIR
  // PIR binary sensor to off after a delay:
  if (pir_state && (sinceStart - last_pir_trigered > DELTA_MS_TO_TURN_OFF_MOVS))
  {
    pir_state = LOW;
    flag_publish_pir = HIGH;
  }
#endif

#ifdef PIN_VIBRO
  // Vibration binary sensor to off after a delay:
  if (vibro_state && (sinceStart - last_vibro_trigered > DELTA_MS_TO_TURN_OFF_VIBRO))
  {
    vibro_state = LOW;
    flag_publish_vibro = HIGH;
  }
#endif
}

bool publish_motion_and_light_sensors_if_flag_or_delta()
{
  bool any_publish = false;
#ifdef PIN_PIR
  // Update PIR state:
  if (flag_publish_pir)
  {
#ifdef LED_PIR
    digitalWrite(LED_PIR, pir_state);
#endif
    flag_publish_pir = !publish_mqtt_binary_sensor("MOVEMENT", "MOVEMENT OFF", pir_state, mqtt_movement_topic);
    any_publish = !flag_publish_pir;
  }
#endif

#ifdef PIN_VIBRO
  // Update vibro sensor state:
  if (flag_publish_vibro)
  {
#ifdef LED_VIBRO
    digitalWrite(LED_VIBRO, vibro_state);
#endif
    flag_publish_vibro = !publish_mqtt_binary_sensor("VIBRATION", "VIBRATION OFF", vibro_state, mqtt_vibro_topic);
    any_publish = !flag_publish_vibro || any_publish;
  }
#endif

#ifdef PIN_LIGHT_SENSOR_DIGITAL
  // Update LIGHT state:
  if (flag_publish_light || (sinceStart - last_light_post > MQTT_POSTINTERVAL_LIGHT_SEC * 1000))
  {
    float light_percentage;

    if (!flag_publish_light)
    {
      light_state = digitalRead(PIN_LIGHT_SENSOR_DIGITAL);
      if (light_state != last_light_post_state)
      {
        last_light_post_state = light_state;
        flag_publish_light = !publish_mqtt_binary_sensor("LIGHT", "LIGHT OFF", !light_state, mqtt_light_topic);
        any_publish = !flag_publish_light || any_publish;
      }
    }
    else
    {
      last_light_post_state = light_state;
      flag_publish_light = !publish_mqtt_binary_sensor("LIGHT", "LIGHT OFF", !light_state, mqtt_light_topic);
      any_publish = !flag_publish_light || any_publish;
    }

#ifdef PIN_LIGHT_SENSOR_ANALOG
    light_percentage = read_analog_light_percentage();
    flag_publish_light = !publish_mqtt_data("LIGHT", mqtt_light_analog_topic,
                                            String(light_percentage).c_str(), false);
    any_publish = !flag_publish_light || any_publish;
#endif

