azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
    if (!flag_publish_light)
      last_light_post = sinceStart;

    return any_publish;
  }
#endif
}

bool publish_dht22_sensor_data()
{
#ifdef DHTPIN
  //post MQTT DHT22 data every X seconds
  if ((error_counter_dht == 0) && (sinceStart - last_dht22_post > MQTT_POSTINTERVAL_DHT22_SEC * 1000))
  {
    bool publishing = false;

    calc_sensor_stats(&tempSamples, &tempHistory);
    if(tempHistory.size() > 0)
    {
      publishing = publish_mqtt_data("TEMP", mqtt_temp_topic,
                                     String(tempHistory.front()).c_str(), false);
    }

    calc_sensor_stats(&humidSamples, &humidHistory);
    if(humidHistory.size() > 0)
    {
      publishing = publish_mqtt_data("HUMID", mqtt_humid_topic,
                                     String(humidHistory.front()).c_str(), false);
    }

    if (publishing)
      last_dht22_post = sinceStart;

    return publishing;
  }
#endif

  return false;
}

bool publish_mqtt_data(const char* type_publish, const char* topic_prefix, const char* payload, boolean retained)
{
#ifdef VERBOSE
  Serial.print("PUBLISH ");
  Serial.print(type_publish);
  Serial.print(": topic=");
  Serial.print((topic_prefix + String(MAC_char)).c_str());
  Serial.print(" -> ");
  Serial.println(payload);
#endif
  return client.publish((topic_prefix + String(MAC_char)).c_str(), payload, retained);
}

bool publish_mqtt_binary_sensor(const char* name_on, const char* name_off,
                                bool state, const char* topic)
{
  if (state)
    return publish_mqtt_data(name_on, topic, "on", false);
  else
    return publish_mqtt_data(name_off, topic, "off", false);
}

void set_color_rgb(uint16_t red, uint16_t green, uint16_t blue)
{
#ifdef LED_RGB_RED
#ifdef USE_ESP32
  // hueToRGB(color, brightness);  // call function to convert hue to RGB
  // write the RGB values to the pins
  ledcWrite(1, (uint32_t)(red / 4)); // write red component to channel 1, etc.
  ledcWrite(2, (uint32_t)(green / 4));
  ledcWrite(3, (uint32_t)(blue / 4));
#else
  analogWrite(LED_RGB_RED, red);
  analogWrite(LED_RGB_GREEN, green);
  analogWrite(LED_RGB_BLUE, blue);
#endif
#endif
}

bool i_state_critical()
{
  switch (current_state)
  {
    case STATE_INIT:
    case STATE_OK_MEASURE:
    case STATE_OK_PUBLISH:
    case STATE_BIN_PUBLISH:
    case STATE_STANDBY:
    {
      return false;
    }
//    case STATE_WEBACCESS:
    case STATE_ERROR:
    case STATE_WARN:
    case STATE_CRITICAL:
    {
      return true;
    }
  }
}

void set_state(int new_state)
{
  bool state_changed = current_state != new_state;
  current_state = new_state;
  last_state_change = sinceStart;

  // Set RGB LED state:
  switch (current_state)
  {
    case STATE_INIT:
    {
      set_color_rgb(1023, 1023, 1023);
      break;
    }
    case STATE_ERROR:
    {
#ifdef VERBOSE
      if (state_changed)
        Serial.println("ERROR STATE (red)");
#endif
      set_color_rgb(1023, 0, 0);
      break;
    }
    case STATE_WARN:
    {
#ifdef VERBOSE
      if (state_changed)
        Serial.println("WARNING STATE (R+.5G)");
#endif
      set_color_rgb(1023, 512, 0);
      break;
    }
    case STATE_CRITICAL:
    {
#ifdef VERBOSE
      if (state_changed)
        Serial.println("CRITICAL STATE (violet)");
#endif
      set_color_rgb(1023, 0, 1023);
      break;
    }
    case STATE_OK_MEASURE:
    {
      set_color_rgb(0, 0, 1023);
      break;
    }
    case STATE_OK_PUBLISH:
    {
//      Serial.println("OK PUBLISH");
      set_color_rgb(0, 1023, 0);
      break;
    }
    case STATE_BIN_PUBLISH:
    {
//      Serial.println("OK PUBLISH");
      set_color_rgb(0, 255, 512);
      break;
    }
    case STATE_STANDBY:
    {
      set_color_rgb(0, 0, 0);
      break;
    }
  }
}

void isr_pir_change()
{
  if (!pir_state && (sinceStart - last_pir_trigered > DELAY_MIN_MS_ENTRE_MOVS))
  {
    pir_state = HIGH;
    flag_publish_pir = HIGH;
  }
  last_pir_trigered = sinceStart;
}

void isr_vibro_change()
{
  if (!vibro_state && (sinceStart - last_vibro_trigered > DELAY_MIN_MS_ENTRE_VIBRO_SENSOR))
  {
    vibro_state = HIGH;
    flag_publish_vibro = HIGH;
  }
  last_vibro_trigered = sinceStart;
}

#ifdef PIN_LIGHT_SENSOR_DIGITAL
void isr_light_sensor_change()
{
  if (sinceStart - last_light_trigered > DELAY_MIN_MS_ENTRE_LIGHT_SENSOR)
  {
    bool new_light_state = digitalRead(PIN_LIGHT_SENSOR_DIGITAL);
    if (new_light_state != light_state)
    {
      light_state = !light_state;
      flag_publish_light = HIGH;
    }
  }
  last_light_trigered = sinceStart;
}
#endif

#ifdef PIN_LIGHT_SENSOR_ANALOG
float read_analog_light_percentage()
{
  float light_percentage;

  light_percentage = round(100. * (1023 - analogRead(PIN_LIGHT_SENSOR_ANALOG)) /  10.23) / 100.;
//#ifdef VERBOSE
//  Serial.print("LIGHT: ");
//  Serial.print(light_percentage);
//  Serial.println(" %");
//#endif
  return light_percentage;
}
#endif

void sample_dht22_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef DHTPIN
  // Collect the DHT22 sensor data
  if(sinceStart - last_dht_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    double temp = -999;
    double humid = -999;
    sensors_event_t event;

    *sampled = true;
    //Collect the temperature from a sensor.
    dht.temperature().getEvent(&event);
    if (!isnan(event.temperature))
    {
      temp = event.temperature;
#ifdef VERBOSE
      Serial.print("Temp: ");
      Serial.print(temp);
      Serial.print(" ^C, ");
#endif
    }
    // Get humidity event and print its value.
    dht.humidity().getEvent(&event);
    if (!isnan(event.relative_humidity))
    {
      humid = event.relative_humidity;
#ifdef VERBOSE
      Serial.print("Humidity: ");
      Serial.print(humid);
      Serial.println(" %");
#endif
    }

    if ((temp == -999) || (humid == -999))
    {
      sensor_t sensor;
#ifdef VERBOSE
      Serial.print("DHT ERROR # ");
      Serial.print(error_counter_dht);
      Serial.print(": ");
      Serial.print(temp);
      Serial.print(" / ");
      Serial.println(humid);
#endif
      dht.begin();
      dht.temperature().getSensor(&sensor);
      last_sensor_error = sinceStart;
      error_counter_dht += 1;
      *sample_ok = false;

