azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
      if (error_counter_dht > NUM_MAX_ERRORS_DHT)
        reset_exec();
    }
    else
    {
      last_sensor_ok = sinceStart;
      *sample_ok = true;
      error_counter_dht = 0;

      //Make sure a valid temperature was sampled
      if(temp != -999)
        tempSamples.push_front(temp);

      if(humid != -999)
        humidSamples.push_front(humid);
    }

    last_dht_sensed = sinceStart;
  }
#endif
}

#ifdef DHTPIN
void calc_sensor_stats(std::list<double> *samples, std::list<double> *history)
{
  int count = 0;
  double tempsum = 0;
  double tempaverage;

  if(samples->size() > 0)
  {
    for(std::list<double>::iterator sensiter = samples->begin(); sensiter != samples->end(); sensiter++)
    {
      count++;
      tempsum += *sensiter;
    }
    tempaverage = tempsum / count;

    //Add the new data to the history.
    history->push_front(tempaverage);
    if(history->size() > SENSOR_HISTORY_RECORDS)
    {
      history->pop_back();
    }
  }
  samples->clear();
}
#endif

//**********************************
//** Setup methods
//**********************************
void setup_timers()
{
  sinceStart = 0;
  last_state_change = 0;
  last_sensor_error = 0;
  last_sensor_ok = 0;
  last_dht_sensed = 0;                //The last time a sample was taken from the DHT22 sensor.
  error_counter_dht = 1;
  last_dht22_post = 15000;            // Init value to wait some time before the 1st publish.
  last_light_post = 15000;            // Init value to wait some time before the 1st publish.
  flag_publish_light = HIGH;
}

void setup_leds()
{
#ifdef LED_PIR
  pinMode(LED_PIR, OUTPUT);
#endif
#ifdef LED_VIBRO
  pinMode(LED_VIBRO, OUTPUT);
#endif

#ifdef LED_RGB_RED
#ifdef USE_ESP32
  ledcAttachPin(LED_RGB_RED, 1); // assign RGB led pins to channels
  ledcAttachPin(LED_RGB_GREEN, 2);
  ledcAttachPin(LED_RGB_BLUE, 3);
  // Initialize channels
  // channels 0-15, resolution 1-16 bits, freq limits depend on resolution
  // ledcSetup(uint8_t channel, uint32_t freq, uint8_t resolution_bits);
  ledcSetup(1, 12000, 8); // 12 kHz PWM, 8-bit resolution
  ledcSetup(2, 12000, 8);
  ledcSetup(3, 12000, 8);
#else
  pinMode(LED_RGB_RED, OUTPUT);
  pinMode(LED_RGB_GREEN, OUTPUT);
  pinMode(LED_RGB_BLUE, OUTPUT);
#endif
#endif
}

#ifdef DHTPIN
void setup_temp_sensor()
{
  dht.begin();
  sensor_t sensor;
  dht.temperature().getSensor(&sensor);
#ifdef VERBOSE
  Serial.println("------------------------------------");
  Serial.println("Temperature");
  Serial.print  ("Sensor:       "); Serial.println(sensor.name);
  Serial.print  ("Driver Ver:   "); Serial.println(sensor.version);
  Serial.print  ("Unique ID:    "); Serial.println(sensor.sensor_id);
  Serial.print  ("Max Value:    "); Serial.print(sensor.max_value); Serial.println(" *C");
  Serial.print  ("Min Value:    "); Serial.print(sensor.min_value); Serial.println(" *C");
  Serial.print  ("Resolution:   "); Serial.print(sensor.resolution); Serial.println(" *C");
  Serial.println("------------------------------------");
#endif
  dht.humidity().getSensor(&sensor);
  // Print humidity sensor details.
  dht.humidity().getSensor(&sensor);
#ifdef VERBOSE
  Serial.println("------------------------------------");
  Serial.println("Humidity");
  Serial.print  ("Sensor:       "); Serial.println(sensor.name);
  Serial.print  ("Driver Ver:   "); Serial.println(sensor.version);
  Serial.print  ("Unique ID:    "); Serial.println(sensor.sensor_id);
  Serial.print  ("Max Value:    "); Serial.print(sensor.max_value); Serial.println("%");
  Serial.print  ("Min Value:    "); Serial.print(sensor.min_value); Serial.println("%");
  Serial.print  ("Resolution:   "); Serial.print(sensor.resolution); Serial.println("%");
  Serial.println("------------------------------------");
#endif
}
#endif

void setup_boolean_sensors()
{
#ifdef PIN_PIR
  pinMode(PIN_PIR, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_PIR), isr_pir_change, CHANGE);
#endif

#ifdef PIN_VIBRO
  pinMode(PIN_VIBRO, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_VIBRO), isr_vibro_change, CHANGE);
#endif

#ifdef PIN_LIGHT_SENSOR_DIGITAL
  pinMode(PIN_LIGHT_SENSOR_DIGITAL, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_LIGHT_SENSOR_DIGITAL), isr_light_sensor_change, CHANGE);
#endif

#ifdef PIN_LIGHT_SENSOR_ANALOG
  pinMode(PIN_LIGHT_SENSOR_ANALOG, INPUT);
#endif
}

void connectWiFi()
{
  elapsedMillis wifi_try = 0;
#ifdef USE_ESP32
  //char *pass = (char*) malloc(strlen(WiFiPSK));
  //strcpy(pass, WiFiPSK);
  WiFi.begin((char *)WiFiSSID, (const char *)WiFiPSK);
#else
  WiFi.mode(WIFI_STA);
  WiFi.begin(WiFiSSID, WiFiPSK);
#endif

#ifdef VERBOSE
  Serial.print("Attempting to connect to WPA SSID: ");
  Serial.print(WiFiSSID);
#endif

  set_state(STATE_CRITICAL);
  while (WiFi.status() != WL_CONNECTED)
  {
#ifdef VERBOSE
    Serial.print (".");
#endif
    //Delay until connected.
    delay(DELAY_MS_BETWEEN_RETRIES);
    if (wifi_try > 60000)
      reset_exec();
  }
#ifdef VERBOSE
  Serial.println("You're connected to the network");
  printWifiStatus();
#endif

  set_state(STATE_STANDBY);
}

#ifdef VERBOSE
void printWifiStatus()
{
  // print the SSID of the network you're attached to
  Serial.print("SSID: ");
  Serial.println(WiFi.SSID());

  // print your WiFi shield's IP address
  IPAddress ip = WiFi.localIP();
  Serial.print("IP Address: ");
  Serial.println(ip);

#ifndef USE_ESP32
// print the received signal strength
  long rssi = WiFi.RSSI();
  Serial.print("Signal strength (RSSI):");
  Serial.print(rssi);
  Serial.println(" dBm");
#endif
}
#endif

void reset_exec()
{
  Serial.println("ABORTING ...");
  set_color_rgb(1023, 200, 200);
  delay(30000);
  ESP.restart();
}